{
  "enemy": [
    "Create a hostile void stalker that adapts to the player's combat style as its main attack with simple AI for overworld exploration",
    "What's the best way to create a lightning spirit that regenerate health by consuming nearby objects? using conditional logic",
    "Explain how to build a earth titan with the ability to control the battlefield lighting and visibility",
    "What's the best way to create a lightning spirit that absorb elemental attacks to grow stronger?",
    "Design a water serpent that can has multiple phases with different abilities with conditional behaviors for overworld exploration",
    "Explain how to build a forest guardian with the ability to absorb elemental attacks to grow stronger using simple mechanics",
    "Build a fire-breathing dragon that has multiple phases with different abilities when the player approaches with simple AI",
    "Design a poison spider that can uses hit-and-run tactics to avoid damage",
    "I need help implementing a forest guardian that mirror the player's equipped weapon and abilities for aerial combat sequences",
    "Create a hostile earth titan that becomes more aggressive as the fight progresses as its main attack with complex AI decision trees for puzzle rooms",
    "Build a earth titan that uses environmental hazards as weapons when the player approaches using advanced pathfinding",
    "Design a poison spider that can uses hit-and-run tactics to avoid damage",
    "Walk me through creating a skeletal warrior that can manipulate gravity in the surrounding area with multiple interaction types for aerial combat sequences",
    "I need help implementing a flying demon that phase through walls to ambush the player",
    "Implement a void stalker enemy with the ability to becomes more aggressive as the fight progresses with simple AI for dungeon encounters",
    "Design a skeletal warrior that can summons smaller minions to assist in battle for puzzle rooms",
    "Walk me through creating a forest guardian that can mirror the player's equipped weapon and abilities with complex state management",
    "Design an enemy forest guardian that summons smaller minions to assist in battle to defend its territory with simple AI",
    "What's the best way to create a crystal golem that mirror the player's equipped weapon and abilities? using simple mechanics in a fire temple environment",
    "Walk me through creating a void stalker that can split into multiple smaller enemies when defeated with complex state management for underwater combat"
  ],
  "npc": [
    "I need a musician that can character customization options for the player with simple mechanics",
    "I need a healer that can skill training and tutorials for the player",
    "How would you implement a healer that rare item trading and exchange? using basic UI for a specialized shop",
    "How would you implement a guard that inventory management and storage? using reputation systems in a market area",
    "Create a scholar NPC that provides information about dungeon layouts",
    "How do I create a healer NPC that maintains a mini-game or challenge? for a mini-game area",
    "I need a librarian that can information about dungeon layouts for the player",
    "I need a musician that can item repair and enhancement services for the player",
    "How do I create a scholar NPC that teaches new skills or abilities?",
    "Create a craftsman NPC that provides skill training and tutorials using reputation systems for a specialized shop",
    "Design a healer NPC that can maintains a mini-game or challenge in a story cutscene",
    "How would you implement a storyteller that magical enchantments for equipment?",
    "How would you implement a cook that inventory management and storage? with dynamic pricing in a market area",
    "I need a innkeeper that can quest coordination and tracking for the player using reputation systems for a specialized shop",
    "Build a storyteller character that offers to upgrade the player's equipment when approached",
    "Design a merchant NPC that can offers to upgrade the player's equipment using complex relationship systems for a mini-game area",
    "Design a healer NPC that can gives quests based on player progress with dynamic dialogue trees for a mini-game area",
    "Create a librarian NPC that provides information about dungeon layouts with dynamic pricing",
    "How would you implement a innkeeper that rare item trading and exchange? using currency systems for a temporary event",
    "Create a trainer NPC that provides magical enchantments for equipment using currency systems"
  ],
  "item": [
    "Build a power gauntlet item that reveals hidden passages and secrets when used with simple effects for puzzle solving",
    "Design a crystal shield that can reveals hidden passages and secrets using basic mechanics",
    "Design a utility tool that can allows temporary flight or levitation using resource management for puzzle solving",
    "Design a enchanted bow that can creates protective barriers against attacks for combat enhancement",
    "I want to implement a puzzle key that manipulates time flow in small areas with conditional effects",
    "Build a crystal shield item that reveals hidden passages and secrets when used using basic mechanics for story progression",
    "How do I create a power gauntlet with the ability to reveals hidden passages and secrets?",
    "Build a stealth cloak item that allows temporary flight or levitation when used with simple effects for story progression",
    "I want to implement a transformation mask that transforms the player's appearance or abilities for story progression",
    "How do I create a enchanted bow with the ability to provides enhanced vision in dark areas? for exploration mechanics",
    "Build a crystal shield item that reveals hidden passages and secrets when used for puzzle solving",
    "How do I create a elemental stone with the ability to creates protective barriers against attacks? with conditional effects",
    "Build a magical sword item that amplifies the player's magical abilities when used with conditional effects for combat enhancement",
    "How do I create a stealth cloak with the ability to amplifies the player's magical abilities? with complex interactions",
    "I want to implement a puzzle key that provides enhanced vision in dark areas for optional content"
  ],
  "object": [
    "Build a sliding door object that activates when multiple conditions are met when activated with simple activation",
    "How would you implement a temporal gate that generates force fields and barriers? using interconnected systems",
    "Design a pressure switch mechanism that generates force fields and barriers using timing mechanisms for dungeon progression",
    "I need a energy conduit that can moves in complex patterns to create platforms",
    "How would you implement a mechanical lift that changes the room's layout dynamically? with simple activation for environmental storytelling",
    "Design a pressure switch mechanism that synchronizes with other mechanisms with multiple states",
    "Design a energy conduit mechanism that changes the room's layout dynamically with simple activation for secret areas",
    "Design a ancient statue mechanism that responds to specific musical sequences using interconnected systems for puzzle rooms",
    "Design a pressure switch mechanism that manipulates light and shadow patterns with simple activation for environmental storytelling",
    "Design a ancient statue mechanism that controls water levels and flow with complex sequences for environmental storytelling",
    "How would you implement a crystal mechanism that generates force fields and barriers? using basic collision for environmental storytelling",
    "I need a mechanical lift that can responds to specific musical sequences using timing mechanisms",
    "Build a magical portal object that opens passages based on player inventory when activated for dungeon progression",
    "Build a temporal gate object that manipulates light and shadow patterns when activated with multiple states",
    "Design a energy conduit mechanism that manipulates light and shadow patterns with simple activation"
  ],
  "background": [
    "Design a cave area that generates ambient sounds and atmosphere",
    "How do I create a cave that generates ambient sounds and atmosphere?",
    "Build an environmental system that responds to player actions with environmental changes over time",
    "I want to implement an environmental hazard that creates dynamic weather patterns",
    "How do I create a cave that changes lighting based on time of day?",
    "Design a temple area that creates dynamic weather patterns",
    "Design a forest area that responds to player actions with environmental changes",
    "Build an environmental system that generates ambient sounds and atmosphere over time",
    "Design a lake area that changes lighting based on time of day",
    "Design a temple area that creates dynamic weather patterns"
  ],
  "effect": [
    "Design a atmospheric that creates realistic fire and smoke",
    "Build a lighting effect that creates swirling energy patterns when triggered",
    "I need a atmospheric effect that can produces dynamic color transitions",
    "Build a magical effect that produces dynamic color transitions when triggered",
    "I need a atmospheric effect that can creates realistic fire and smoke",
    "Build a elemental effect that generates magical aura effects when triggered",
    "I need a lighting effect that can creates swirling energy patterns",
    "How would you implement a particle that creates realistic fire and smoke?",
    "Design a particle that produces dynamic color transitions",
    "Design a atmospheric that generates magical aura effects"
  ],
  "player": [
    "I want to build a combat that adapts to different weapon types",
    "Design a progression system that can handles complex object interactions",
    "How do I implement a movement that adapts to different weapon types?",
    "Create a progression mechanic that handles complex object interactions",
    "Create a movement mechanic that manages item collection and usage",
    "Design a inventory system that can handles complex object interactions",
    "I want to build a inventory that provides responsive movement controls",
    "I want to build a inventory that adapts to different weapon types",
    "Design a combat system that can manages item collection and usage",
    "I want to build a progression that provides responsive movement controls"
  ],
  "misc": [
    "I need to implement a save that provides intuitive menu navigation",
    "How would you create a UI that automatically saves progress at checkpoints?",
    "How would you create a UI that automatically saves progress at checkpoints?",
    "Design a audio mechanism that handles multiplayer synchronization",
    "How would you create a camera that smoothly follows player movement?",
    "Build a save system that smoothly follows player movement dynamically",
    "How would you create a audio that dynamically adjusts audio based on environment?",
    "How would you create a audio that handles multiplayer synchronization?",
    "I need to implement a save that handles multiplayer synchronization",
    "How would you create a camera that provides intuitive menu navigation?"
  ]
}